hacking/mobile/android/3. 안드로이드 앱 진단/data-storage-on-android.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>안드로이드 중요 데이터 저장 보안 점검</title>
<!-- 2018-05-31 목 17:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">안드로이드 중요 데이터 저장 보안 점검</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 중요 데이터가 저장된 로컬 저장소 점검</a>
<ul>
<li><a href="#sec-1-1">1.1. 개요</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Shared Preferences</a></li>
<li><a href="#sec-1-1-2">1.1.2. SQLite Database (Unencrypted)</a></li>
<li><a href="#sec-1-1-3">1.1.3. SQLite Database (encrypted)</a></li>
<li><a href="#sec-1-1-4">1.1.4. Realm Databases</a></li>
<li><a href="#sec-1-1-5">1.1.5. Internal Storage</a></li>
<li><a href="#sec-1-1-6">1.1.6. External Storage</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 정적 분석</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Local Storage</a></li>
<li><a href="#sec-1-2-2">1.2.2. KeyStore</a></li>
<li><a href="#sec-1-2-3">1.2.3. Older KeyStore Implementations</a></li>
<li><a href="#sec-1-2-4">1.2.4. KeyChain</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Dynamic Analysis</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 중요 데이터가 저장된 로그 점검</a>
<ul>
<li><a href="#sec-2-1">2.1. 개요</a></li>
<li><a href="#sec-2-2">2.2. 정적 분석</a></li>
<li><a href="#sec-2-3">2.3. 동적 분석</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 서드 파티로 중요 정보가 전달되었는지 점검</a>
<ul>
<li><a href="#sec-3-1">3.1. 개요</a></li>
<li><a href="#sec-3-2">3.2. 정적 분석</a></li>
<li><a href="#sec-3-3">3.3. 동적 분석</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 텍스트 입력 필드에 키보드 캐시 저장이 안되도록 되어 있는지 점검</a>
<ul>
<li><a href="#sec-4-1">4.1. 개요</a></li>
<li><a href="#sec-4-2">4.2. 정적 분석</a></li>
<li><a href="#sec-4-3">4.3. 동적 분석</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 클립보드에 중요 정보가 저장되었는지 찾기</a>
<ul>
<li><a href="#sec-5-1">5.1. 개요</a></li>
<li><a href="#sec-5-2">5.2. 정적 분석</a></li>
<li><a href="#sec-5-3">5.3. 동적 분석</a></li>
</ul>
</li>
<li><a href="#sec-6">6. IPC 메커니즘을 통해 저장된 중요 정보가 노출되고 있는지 점검</a>
<ul>
<li><a href="#sec-6-1">6.1. 개요</a></li>
<li><a href="#sec-6-2">6.2. 정적 분석</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1. Inspect the Android Manifest</a></li>
<li><a href="#sec-6-2-2">6.2.2. Inspect the source code</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3. 동적 분석</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1. Testing Content Providers</a></li>
<li><a href="#sec-6-3-2">6.3.2. SQL Injection in Content Providers</a></li>
<li><a href="#sec-6-3-3">6.3.3. File System Based Content Providers</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. 유저 인터페이스를 통해 중요 정보가 노출되고 있는 점검</a>
<ul>
<li><a href="#sec-7-1">7.1. 개요</a></li>
<li><a href="#sec-7-2">7.2. 정적 분석</a></li>
<li><a href="#sec-7-3">7.3. 동적 분석</a></li>
</ul>
</li>
<li><a href="#sec-8">8. 중요 데이터가 백업되어 있는지 점검</a>
<ul>
<li><a href="#sec-8-1">8.1. 개요</a></li>
<li><a href="#sec-8-2">8.2. 정적 분석</a>
<ul>
<li><a href="#sec-8-2-1">8.2.1. Local</a></li>
<li><a href="#sec-8-2-2">8.2.2. Cloud</a></li>
</ul>
</li>
<li><a href="#sec-8-3">8.3. 동적 분석</a></li>
</ul>
</li>
<li><a href="#sec-9">9. 자동으로 만들어지는 스크린샷에 중요 정보가 있는지 점검</a>
<ul>
<li><a href="#sec-9-1">9.1. 개요</a></li>
<li><a href="#sec-9-2">9.2. 정적 분석</a></li>
<li><a href="#sec-9-3">9.3. 동적 분석</a></li>
</ul>
</li>
<li><a href="#sec-10">10. 메모리에 중요 데이터가 있는지 점검</a>
<ul>
<li><a href="#sec-10-1">10.1. 개요</a></li>
<li><a href="#sec-10-2">10.2. 정적 분석</a></li>
<li><a href="#sec-10-3">10.3. 동적 분석</a></li>
</ul>
</li>
<li><a href="#sec-11">11. 디바이스 접근 보안 정책 점검</a>
<ul>
<li><a href="#sec-11-1">11.1. 개요</a></li>
<li><a href="#sec-11-2">11.2. 정적 분석</a></li>
<li><a href="#sec-11-3">11.3. 동적 분석</a></li>
</ul>
</li>
<li><a href="#sec-12">12. References</a>
<ul>
<li><a href="#sec-12-1">12.1. OWASP Mobile Top 10 2016</a></li>
<li><a href="#sec-12-2">12.2. OWASP MASVS</a></li>
<li><a href="#sec-12-3">12.3. CVE</a></li>
<li><a href="#sec-12-4">12.4. Tools</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Protecting authentication tokens, private information, and other sensitive data is key to mobile security. In this chapter, you will learn about the APIs Android offers for local data storage and best practices for using them.
</p>

<p>
The guidelines for saving data can be summarized quite easily: Public data should be available to everyone, but sensitive and private data must be protected, or, better yet, kept out of device storage.
</p>

<p>
Note that the meaning of "sensitive data" depends on the app that handles it. Data classification is described in detail in the "Identifying Sensitive Data" section of the chapter "Mobile App Security Testing."
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 중요 데이터가 저장된 로컬 저장소 점검</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 개요</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Conventional wisdom suggests that as little sensitive data as possible should be stored on permanent local storage. In most practical scenarios, however, some type of user data must be stored. For example, asking the user to enter a very complex password every time the app starts isn't a great idea in terms of usability. Most apps must locally cache some kind of authentication token to avoid this. Personally identifiable information (PII) and other types of sensitive data may also be saved if a given scenario calls for it.
</p>

<ul class="org-ul">
<li>전통적으로 중요 데이터는 가능한한 로컬 저장소에 저장하지 않아야 한다고 알려져 있다. 
</li>
<li>그러나 대부분의 현실 상황에서는 몇종류의 사용자 데이터는 저장해야 한다. 
</li>
<li>예를 들어, 사용자에게 복잡한 패스워드를 매번 입력하게 하는 것은 사용성에 있어서 좋지 않은 생각이다. 
</li>
<li>이를 피하기 위해 대부분의 앱은 로컬 캐시에 몇 종류의 인증 토큰을 저장한다. 
</li>
<li>주어진 상황이 요구한다면 개인 식별 정보와 기타 다른 종류의 민감한 정보 역시 저장될 것이다.
</li>
</ul>

<p>
Sensitive data is vulnerable when it is not properly protected by the app that is persistently storing it. The app may be able to store the data in several places, for example, on the device or on an external SD card. When you're trying to exploit these kinds of issues, consider that a lot of information may be processed and stored in different locations. Identifying at the outset the kind of information processed by the mobile application and input by the user is important. Identifying information that may be valuable to attackers (e.g., passwords, credit card information, PII) is also important.
</p>

<ul class="org-ul">
<li>민감한 데이터는 그 것을 저장하는 앱에 의해 적절히 보호되어야 한다. 
</li>
<li>그리고 앱은 데이터를 여러 장소, 예를 들면 디바이스나 외부 SD 카드 등에 저장할 수 있다. 
</li>
<li>모바일 앱이 처리하는 정보, 사용자가 입력하는 정보 등을 식별하는 것이 중요하다. 
</li>
<li>그리고 공격자가 노릴만한 정보 (비밀번호, 신용 카드 정보, 개인 식별 정보)를 식별하는 것 역시 중요하다. 
</li>
</ul>

<p>
Disclosing sensitive information has several consequences, including decrypted information. In general, an attacker may identify this information and use it for additional attacks, such as social engineering (if PII has been disclosed), account hijacking (if session information or an authentication token has been disclosed), and gathering information from apps that have a payment option (to attack and abuse them).
</p>

<ul class="org-ul">
<li>중요 데이터가 노출되면 추가 공격을 받을 수 있다. 
</li>
<li>소셜엔지니어링(개인 식별 번호가 노출된 경우)
</li>
<li>계정 하이재킹 (세션 정보나 인증 토큰이 노출된 경우)
</li>
<li>무단 결제 등
</li>
</ul>

<p>
Storing data is essential for many mobile apps. For example, some apps use data storage to keep track of user settings or
user-provided data. Data can be stored persistently in several ways. The following list of storage techniques are widely used
on the Android platform:
</p>

<ul class="org-ul">
<li>안드로이드 앱에 데이터를 저장하는 것은 필수적이다. 
</li>
<li>예를 들어 유저의 설정 값이나 유저가 제공한 데이터를 저장하기 위해 데이터 저장소를 사용하는 등이다.
</li>
<li>데이터는 몇 가지 방법을 통해 영구적으로 저장할 수 있다. 
</li>
</ul>

<p>
다음 목록은 안드로이드 플랫폼에서 널리 쓰이는 저장 기술이다. 
</p>

<ol class="org-ol">
<li>Shared Preferences
</li>
<li>SQLite Databases
</li>
<li>Realm Databases
</li>
<li>Internal Storage
</li>
<li>External Storage
</li>
</ol>

<p>
The following code snippets demonstrate bad practices that disclose sensitive information. They also illustrate Android
storage mechanisms in detail. For more information, check out the <b>Security Tips for Storing Data</b> in the Android developer's
guide.
</p>

<ul class="org-ul">
<li>이후에 나오는 코드 조각들은 중요 정보를 노출시키는 안 좋은 코딩 방식을 보여줄 것이다.
</li>
<li>또한 안드로이드의 저장 메커니즘을 자세하게 설명할 것이다. 
</li>
<li>더 자세한 내용은 안드로이드 개발자 가이드의 <b>Security Tips for Storing Data</b> 를 참고하라. 
</li>
</ul>
</div>


<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Shared Preferences</h4>
</div>


<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> SQLite Database (Unencrypted)</h4>
</div>


<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> SQLite Database (encrypted)</h4>
</div>


<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Realm Databases</h4>
</div>


<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Internal Storage</h4>
</div>


<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> External Storage</h4>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 정적 분석</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Local Storage</h4>
</div>


<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> KeyStore</h4>
</div>


<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Older KeyStore Implementations</h4>
</div>


<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> KeyChain</h4>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Dynamic Analysis</h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 중요 데이터가 저장된 로그 점검</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 개요</h3>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 정적 분석</h3>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 동적 분석</h3>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 서드 파티로 중요 정보가 전달되었는지 점검</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 개요</h3>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 정적 분석</h3>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 동적 분석</h3>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 텍스트 입력 필드에 키보드 캐시 저장이 안되도록 되어 있는지 점검</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 개요</h3>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 정적 분석</h3>
</div>


<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 동적 분석</h3>
</div>
</div>




<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 클립보드에 중요 정보가 저장되었는지 찾기</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 개요</h3>
</div>


<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 정적 분석</h3>
</div>


<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 동적 분석</h3>
</div>
</div>



<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> IPC 메커니즘을 통해 저장된 중요 정보가 노출되고 있는지 점검</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 개요</h3>
</div>


<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 정적 분석</h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> Inspect the Android Manifest</h4>
</div>

<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> Inspect the source code</h4>
</div>
</div>


<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 동적 분석</h3>
<div class="outline-text-3" id="text-6-3">
</div><div id="outline-container-sec-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> Testing Content Providers</h4>
</div>


<div id="outline-container-sec-6-3-2" class="outline-4">
<h4 id="sec-6-3-2"><span class="section-number-4">6.3.2</span> SQL Injection in Content Providers</h4>
</div>

<div id="outline-container-sec-6-3-3" class="outline-4">
<h4 id="sec-6-3-3"><span class="section-number-4">6.3.3</span> File System Based Content Providers</h4>
</div>
</div>
</div>



<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 유저 인터페이스를 통해 중요 정보가 노출되고 있는 점검</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 개요</h3>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 정적 분석</h3>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 동적 분석</h3>
</div>
</div>




<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 중요 데이터가 백업되어 있는지 점검</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 개요</h3>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 정적 분석</h3>
<div class="outline-text-3" id="text-8-2">
</div><div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> Local</h4>
</div>


<div id="outline-container-sec-8-2-2" class="outline-4">
<h4 id="sec-8-2-2"><span class="section-number-4">8.2.2</span> Cloud</h4>
</div>
</div>


<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 동적 분석</h3>
</div>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 자동으로 만들어지는 스크린샷에 중요 정보가 있는지 점검</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 개요</h3>
</div>


<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> 정적 분석</h3>
</div>


<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> 동적 분석</h3>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 메모리에 중요 데이터가 있는지 점검</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> 개요</h3>
</div>




<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> 정적 분석</h3>
</div>



<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> 동적 분석</h3>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 디바이스 접근 보안 정책 점검</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> 개요</h3>
</div>


<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> 정적 분석</h3>
</div>


<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> 동적 분석</h3>
</div>
</div>



<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> References</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> OWASP Mobile Top 10 2016</h3>
</div>

<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> OWASP MASVS</h3>
</div>

<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> CVE</h3>
</div>

<div id="outline-container-sec-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> Tools</h3>
<div class="outline-text-3" id="text-12-4">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-05-31 목 17:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
